# BOJ 11726 - S3
# 2*n 타일링
# 26.03.09
import sys

input = sys.stdin.readline
"""
DP연습문제(5)
[WIL]
- 과거의 행동이 현재의 선택에 제약을 주지 않으면 1차원배열
- 즉 내가 고를 수 있는 '선택지(메뉴판)' 이 압수당하는가?=>2차원배열
- 이문제는 1차원배열로 풀이가능 
- INT 오버플로우 방지 -> 매 반복문마다 MOD 해주기.

2*n 직사각형을 (1x2),(2x1)로 채우는 방법의 수=?
"""
n = int(input())  # 1<=n<=1000
dp = [[0, 0]] + [[0] * 2 for _ in range(n)]

"""
dp[i][j] = i번째 col 까지 칠했을때 경우의 수,단
j=0 : i번째 col은 (2*1)세로블록으로 칠함
j=1 : i-1,i번째 col은 (1*2)가로블록으로 칠함
"""
if n == 1:
    print(1)
    sys.exit()

dp[1][0] = 1
dp[1][1] = 0
dp[2][0] = 1
dp[2][1] = 1

# dp[3]~dp[n] 채우기
for i in range(3, n + 1):
    # i-1까지 칠하고, 마지막 세로블록
    dp[i][0] = (dp[i - 1][0] + dp[i - 1][1]) % 10007

    # i-2까지 칠하고, i-1,i 는 가로블록
    dp[i][1] = (dp[i - 2][0] + dp[i - 2][1]) % 10007

# 출력 : result % 10007
result = dp[n][0] + dp[n][1]
print(result % 10007)


# print(dp)
